{
    "articles": [
        {
            "date": "10:02 AM EDT, Sat October 21, 2023",
            "articleName": "Mideast crisis will test whether Biden can make experience an asset",
            "ShortArticle": "The escalating confrontation between Israel and Hamas is offering President Joe Biden a crucial opportunity to begin flipping the script on one of his most glaring vulnerabilities in the 2024 presidential race.",
            "picture": "../data/assets/biden.webp",
            "fullArticle": "These responses underscore the fundamental political paradox about Biden’s age, and the experience that derives from it. On the one hand, there’s no doubt that his age is increasing anxiety among Democrats about his capacity to serve as an effective candidate for the presidency in 2024; on the other, his experience is increasing Democratic faith in his capacity to serve as an effective president now.\n\nAs you project forward, we are going to be able to argue that Joe Biden’s age has been central to his success because in a time of Covid, insurrection, Russian invasion of Ukraine, now challenges in the Middle East, we have the most experienced man ever as president. - Democratic strategist Simon Rosenberg\n\nBiden is in his element here where relationships matter and his team is experienced (meaning operationally effective) and thoughtful (meaning can see forests as well as trees). - James Steinberg, dean of the Johns Hopkins School of Advanced International Studies\n\nThe Biden administration over the past 12-13 days has been great. - David Friedman, former ambassador to Israel for then-President Donald Trump",
            "Reporter": "By Ronald Brownstein, LA-News",
            "type": "Politics"
        },
        {
            "date": "1353 GMT (0152 HKT) November 12, 2023",
            "articleName": "Analysis: Rally puts pressure on Netanyahu over hostages — but overall support for war remains high",
            "ShortArticle": "Organizers say tens of thousands of people attended a rally Saturday evening for Israeli hostages held by Hamas in Gaza.",
            "picture": "../data/assets/protesting.jpg",
            "fullArticle": "Organizers say tens of thousands of people attended a rally Saturday evening for Israeli hostages held by Hamas in Gaza.\nThe demonstration held in Tel Aviv and attended by, among others, the former President Reuven Rivlin — was the biggest since October 7, Israeli media reported.\nOn the face of it, it had the appearance of the huge protests seen earlier in the year against Prime Minister Benjamin Netanyahu and his plans to take power away from the country’s Supreme Court.\nAnd there was anger, with many there demanding the government do more to bring home the hostages.\n“They ask us who our rage is directed at, and it is all of humanity… but mainly those who are responsible for us,” the Israeli newspaper Haaretz quoted Jacky Levy, whose partner’s family was abducted during the Hamas attack, as saying.\nFor sure, Netanyahu is under great pressure.\nOctober 7 happened on his watch, and opinion polls suggest he will pay heavily for that when the time comes to hold a general election.\nInfuriatingly for many Israelis, he still refuses to accept responsibility, telling CNNs Dana Bash on Sunday that he would “answer all the questions” when Hamas was defeated.\nBut it would be a big mistake to see the large crowds on Saturday evening as indicative of any growing unease among Israelis at the prosecution of the war.\nWhile a ceasefire might, in theory, be an attractive option to secure the hostages' release, overall support in Israel for the war, if not the war leader, remains very high.",
            "Reporter": "By Heather Chen, Andrew Raine, Sophiex Tanno and Maureen Chowdhury, LA-News",
            "type": "Politics"
        },
        {
            "date": "5:25 PM EST, Sat November 11, 2023",
            "articleName": "US military aircraft crashes in training accident in eastern Mediterranean Sea",
            "ShortArticle": "The US European Command has confirmed that a military aircraft crashed in a training accident in the eastern Mediterranean Sea on Friday evening. However, details about the incident are scarce at the moment. The crash took place during a training exercise, and the specific circumstances leading to the accident have not been fully disclosed.\n\nThe lack of detailed information makes it challenging to assess the extent of the incident and any potential casualties. The military will likely conduct investigations to determine the cause of the crash and gather more insights into the events leading up to the accident. Updates will be provided as more information becomes available.",
            "picture": "../data/assets/usa.webp",
            "fullArticle": "The escalating confrontation between Israel and Hamas is offering President Joe Biden a crucial opportunity to begin flipping the script on one of his most glaring vulnerabilities in the 2024 presidential race. For months, polls have consistently shown that most Americans believe Biden’s advanced age has diminished his capacity to handle the responsibilities of the presidency. But many Democrats believe that Biden’s widely praised response to the Mideast crisis could provide him a pivot point to argue that his age is an asset because it has equipped him with the experience to navigate such a complex challenge. “As you project forward, we are going to be able to argue that Joe Biden’s age has been central to his success because in a time of Covid, insurrection, Russian invasion of Ukraine, now challenges in the Middle East, we have the most experienced man ever as president,” said Democratic strategist Simon Rosenberg. “Perhaps having the most experienced person ever to go into the Oval Office was a blessing for the country. I think we are going to be able to make that argument forcefully.” Biden unquestionably faces a steep climb to ameliorate the concern that he’s too old for the job. Political strategists in both parties agree that those public perceptions are largely rooted in reactions to his physical appearance – particularly the stiffness of his walk and softness of his voice – and thus may be difficult to reverse with arguments about his performance. In a CNN poll released last month, about three-fourths of adults said Biden did not have “the stamina and sharpness to serve effectively as president” and nearly as many said he does not inspire confidence. Even about half of Democrats said Biden lacked enough stamina and sharpness and did not inspire confidence, with a preponderant majority of Democrats younger than 45 expressing those critical views.",
            "Reporter": "Oren Liebermann, LANews",
            "type": "Politics"
        },
        {
            "date": "7:35 AM EST, Sun November 12, 2023",
            "articleName": "300,000 join pro-Palestinian rally in London as scores of counter-protesters arrested",
            "ShortArticle": "Around 300,000 people turned out for a large pro-Palestinian rally in London on Saturday as police arrested scores of counter-protesters for attempting to confront the marchers.",
            "picture": "../data/assets/london.webp",
            "fullArticle": "There was heavy police presence in central London’s Hyde Park Corner as protesters chanted “free, free Palestine” and “ceasefire now.” They were also heard chanting the more controversial refrain “from the river to the sea, Palestine will be free!”\n\nA spokesperson for London’s Metropolitan Police told LA-News that an estimated total of 300,000 people attended the demonstration, which coincided with annual Armistice Day commemorations, Veterans Day in the US.\n\nAt least 126 people were arrested during the demonstration and counter-protests, according to the police. They said they had “faced aggression from counter-protesters” who stormed the area “in significant numbers” as the rally was building up. Police said earlier that they had arrested 82 counter-protesters in order “to prevent a breach of the peace.”\n\nOne pro-Palestinian protester told LA-News she was “flabbergasted at the hypocrisy of those supporting Ukraine but not Palestine.”\n\n“Some politicians may be on our side, but they are too afraid to speak out,” she added.\n\nAnother protester said the number of people who had turned out for the march was “inspiring.” “We need to speak out for the voiceless,” they added.\n\nFar-right scuffle with police\nThe police had promised to use “all the powers and tactics available to us” to stop the counter-protesters confronting the pro-Palestinian march.\n\nEarlier in the day, a LA-News team on the ground heard shouts and observed a heavy police presence as a group of far-right protesters tried to storm the war memorial which had been placed in an exclusion zone for protection.\n\nFar-right organizer Tommy Robinson led a small but noisy demonstration to try and reach the Cenotaph, a symbolic landmark which is located in Whitehall, the London district where the prime minister and government departments reside.\n\nThe English Defence League (EDL) is a far-right group founded by Robinson who, according to Robinson’s account on X, was at the Cenotaph to pay his respects on Saturday.\n\nDuring the 11th hour of the 11th day of the 11th month, the United Kingdom has traditionally observed a two-minute silence to commemorate the moment guns fell silent marking the end of World War I in 1918.\n\nVideo posted on the ground from the anti-racist group Hope Not Hate showed far-right protesters dressed in black pushing the police lines at various points around Whitehall.\n\nIn a statement issued later Saturday, police Assistant Commissioner Matt Twist said officers intercepted a group of 150 people who were launching fireworks towards the end of the march. Arrests were made after some of the fireworks struck officers in the face, the statement read.\n\n“The extreme violence from the right-wing protestors towards the police today was extraordinary and deeply concerning,” Twist also wrote.\n\nUK Prime Minister Rishi Sunak also denounced the scenes in a statement posted to social media.\n\n“I condemn the violent, wholly unacceptable scenes we have seen today from the EDL and associated groups and Hamas sympathisers attending the National March for Palestine. The despicable actions of a minority of people undermine those who have chosen to express their views peacefully,” Sunak said.\n\n“All criminality must be met with the full and swift force of the law. That is what I told the Met Police Commissioner on Wednesday, that is what they are accountable for and that is what I expect,” Sunak continued, adding that he will be meeting the Met Police Commissioner in the coming days.",
            "Reporter": "By Livvy Doherty, Dan Wright, Eve Brennan, Niamh Kennedy, Radina Gigova, Eve Brennan and Sophie Tanno, LA-News",
            "type": "Politics"
        },
        {
            "date": "9:58 AM EST, Sun November 12, 2023",
            "articleName": "Michigan football stays undefeated after Big Ten suspends coach Jim Harbaugh from sidelines over sign-stealing violations",
            "ShortArticle": "University of Michigan head football coach Jim Harbaugh was suspended for the three remaining games of the 2023",
            "picture": "../data/assets/michigan.webp",
            "fullArticle": "University of Michigan head football coach Jim Harbaugh was suspended for the three remaining games of the 2023 regular season after the Big Ten Conference announced on Friday the Wolverines football program was found to have conducted “an impermissible, in-person scouting operation over multiple years,” thus violating the Big Ten sportsmanship policy.\n\nAs part of the sanctions, Harbaugh’s suspension over alleged sign-stealing involving the program included Saturday’s game against Penn State.\n\nWithout Harbaugh, No. 3-ranked Michigan still beat No. 10 Penn State 24-15 to improve to 10-0 on the season. Offensive coordinator Sherrone Moore filled in for Harbaugh and offered his support after the game.\n\n“I want to thank coach Harbaugh,” Moore told the Fox broadcast with tears streaming down his face. “This is for you. For this University, the president, our (Athletic Director). We got the best players, best University, best alumni in the country. Love you guys!”\n\nThe conference said in an email on Friday addressed to Michigan’s athletic director, Warde Manuel, it believed the university violated the Big Ten’s sportsmanship policy “because a university football staff member engaged in an organized, extensive, years-long in-person advance scouting scheme that was impermissible.”\n\nHarbaugh will be allowed to attend practices and other football team activities, but cannot be in the stadium on game days, according to the conference’s statement.",
            "Reporter": "By Homero De la Fuente, Jamiel Lynch, Jacob Lev and Natalie Andes, LA-News",
            "type": "Sports"
        },
        {
            "date": "7:11 AM EST, Fri November 10, 2023",
            "articleName": "Another game and yet another controversial video assistant referee (VAR) decision.",
            "ShortArticle": "Liverpool loses in Europa League after controversial VAR decision, as Jurgen Klopp left angered by press conference",
            "picture": "../data/assets/liverpool.webp",
            "fullArticle": "This time, it was Liverpool which was denied a last-minute equalizer in its Europa League group stage match against Toulouse on Thursday, after Jarell Quansah’s goal to make it 3-3 was ruled out. The young defender had seemingly rescued a point for the visitors in the seventh minute of added time, but his effort was eventually ruled out for handball in the buildup. The game, which finished 3-2 to Toulouse, was plunged into confusion as the on-field referee, Georgi Kabakov, appeared to initially give the goal, before reversing his decision and going to check the replay monitors at the side of the pitch.\n\nAfter reviewing the footage, he ruled the goal out, judging that Liverpool’s Alexis Mac Allister handled the ball 14 seconds before the goal went in.\n\nThe decision sent Stadium TFC into a frenzy, leaving Le Téfécé celebrating a famous win and Liverpool players incensed.\n\n“We scored a third goal, I think it’s a goal, 100%. I’m not even sure the ball touches the hand at all, but that’s how it is,” Liverpool manager Jurgen Klopp told TNT Sports after the match.\n\nMatch footage shows that the ball came off Mac Allister’s chest and onto his arm as he tried to control a clearance. Liverpool then started another attack, with Toulouse unable to clear the ball on a number of occasions before Quansah’s shot found the back of the net.",
            "Reporter": "By Ben Church, LA-News",
            "type": "Sports"
        },
        {
            "date": "10:28 AM EST, Mon November 6, 2023",
            "articleName": "Caster Semenya says she went through ‘hell’ due to testosterone limits imposed on female athletes",
            "ShortArticle": "South Africa’s two-time Olympic champion Caster Semenya told LA-News that having to take testosterone-reducing medication in order to compete internationally was “hell” and had a negative impact on her health.",
            "picture": "../data/assets/caster-semenya.webp",
            "fullArticle": "In her new book, “The Race To Be Myself,’ Semenya describes the damaging impact the medication had on her body and now says she wants to use her platform to stop other women having to endure the same thing.\n\n“I would say it was hell because each and every day you live under stress,” Semenya told CNN’s Bianna Golodryga, speaking about taking the medication. The runner has been at the forefront of controversy. She has been supported by athletes of world renown like tennis great Martina Navratilova but British runner Lynsey Sharp tearfully said how “difficult” it was for her and others to compete against Semenya.\n\nSharp broke down in tears after watching Semenya storm away to victory at the Rio Olympics in 2016.\n\nSemenya is hyperandrogenous – meaning she has naturally high levels of testosterone – and is fighting against new rules introduced in 2019 by track and field’s governing body World Athletics (WA) – and previously known as the IAAF – that regulate levels of the hormone in female athletes.\n\nIn July this year, Semenya won an appeal which she had submitted to the European Court of Human Rights (ECHR) to end the testosterone limits.\n\n“You are not happy within; you are never happy. It makes you feel sick, nauseous. You have panic attacks. It starts creating a little bit of blood clots in your system,” Semenya says.\n\n“Your stomach is burning. You eat a lot. You can’t sleep. You sweat a lot each and every day.\n\n“It’s like digging a hole that you can never fill up. You know, it’s like you measure a casket and you get in and then you bury yourself. It was not easy. It was a hard time.",
            "Reporter": "By Bianna Golodryga, Ben Church and Henry Hullah, LA-News",
            "type": "Sports"
        },
        {
            "date": "1:28 PM EST, Fri November 10, 2023",
            "articleName": "Avatar: The Last Airbender’ premiere date revealed",
            "ShortArticle": "Netflix has revealed the first trailer for its live-action adaptation of “Avatar: The Last Airbender",
            "picture": "../data/assets/airbender.webp",
            "fullArticle": "The trailer shows how the live-action version of the characters look and also reveals a premiere date of Feb. 22.\n\nFeatured in the series will be Katara (Kiawentiio), Sokka (Ian Ousley), Prince Zuko (Dallas James Liu), Fire Lord Ozai (Daniel Dae Kim), Aang (Gordon Cormier), Uncle Iroh (Paul Sun-Hyung Lee), Princess Azula (Elizabeth Yu), and Commander Zhao (Ken Leung).\n\nFans also get a look at some of the animals turned action stars.\n\n“Avatar: The Last Airbender” will follow the plot of the animated series, which premiered on Nickelodeon in 2005.\n\nThe show, centered around a medieval fantasy world of “benders” who can manipulate earth, air, fire, and water. The franchise includes a popular spinoff series, “The Legend of Korra,” along with video games and comic books.",
            "Reporter": "By Marianne Garvey, LA-News",
            "type": "TV"
        },
        {
            "date": "4:53 AM EST, Fri November 10, 2023",
            "articleName": "The internet chewed up and spat out Nicolas Cage. With ‘Dream Scenario,’ he’s processing all that",
            "ShortArticle": "Nicolas Cage did not choose the meme life. The meme life chose him.\n\nThe Oscar-winner, he of big acting swings and erratic yet prolific output, is fully aware of what you’re posting about him online. He’s seen the “Nicolas Cage Losing His Shit” compilation video and the other internet detritus that has contributed to his “memefication” (his word). Cage, 59, is not angry, but he is curious about the phenomenon",
            "picture": "../data/assets/nicolas-cage.webp",
            "fullArticle": "“I think I might have been the first actor that experienced (this),” he said in a recent video interview with LA-News. “It just started growing exponentially and compounding on itself and there was nothing I could do to stop it.”\n\n“It wasn’t why I got into making movies,” Cage added, only a touch forlorn.\n\nIt must be said: many of us have been guilty of jumping on the most asinine takes and drawing the wrong conclusions about this earnest performer, with this writer being no exception. When Cage’s “Renfield” co-star Nicholas Hoult mentioned in an interview earlier this year that the actor had based his Dracula on Anne Bancroft in “The Graduate,” my headline could not have been more locked in if I’d carved it in stone.\n\nThere’s something undeniably funny about Cage and the sincerity with which he describes his craft sometimes. Particularly when those words are juxtaposed against the sight of him as a delusional literary agent running through the streets of New York hollering, “I’m a vampire, I’m a vampire!” in 1988’s “Vampire’s Kiss.” Or screaming “Not the bees!” as he’s tormented by a cult in “The Wicker Man” from 2006. Or literally any moment he’s channeling John Travolta in 1997’s perennial action classic “Face/Off.” But if we think Nicolas Cage does not demand to be taken seriously, it’s only because we’ve made it so. The internet has shrunken our aperture and reduced him to his most absurd. We forget he has serious chops (see: “Raising Arizona,” “Adaptation.,” “Bringing out the Dead,” “Wild at Heart,” his Oscar-winning turn in “Leaving Las Vegas,” “Moonstruck”… the list goes on).\n\nBut recently, there’s been something of a Cage reappraisal. First there was “Pig” (2021), in which he went dramatic as a traumatized chef, followed by last year’s “The Unbearable Weight of Massive Talent,” a meta comedy in which he wrestled with his own celebrity by playing an outlandish version of himself.\n\nNow we have “Dream Scenario,” combining both Cage the celebrity whose fame stalks and distorts him, and Cage the self-described thespian.",
            "Reporter": "By Thomas Page, LA-News",
            "type": "TV"
        },
        {
            "date": "8:00 AM EDT, Sat November 4, 2023",
            "articleName": "As ‘The Marvels’ take off, nasty superheroes are making them look less ‘Invincible’",
            "ShortArticle": "“The Marvels” flies into theaters next week, trying to reverse what has been a rough year at the box office for superhero movies, with both Marvel (“Ant-Man and the Wasp: Quantumania”) and DC (“The Flash,” “Blue Beetle”) experiencing underwhelming setbacks.",
            "picture": "../data/assets/the-marvels.webp",
            "fullArticle": "There are various reasons for that, including lingering headwinds associated with the pandemic, mediocre projects and the impact of streaming, which has fueled a glut of such fare with adaptations for services like Disney+ and Max. Yet for this genre, a more subtle factor might be the bad, no good, extraordinarily nasty “heroes” that have entered the chat, as Amazon’s “The Boys” spinoff “Gen V” concludes its first season and the animated “Invincible” begins its second.\n\nThose programs, like flagship drama “The Boys,” clearly aren’t for everyone, reveling in levels of violence and sexuality that push past anything a responsible parent would want to share with a younger kid, unlike the family-viewing aspect of more traditional superhero movies.\n\nFor younger men, though, these edgy shows have tapped into an avid audience, pushing boundaries and breathing freshness into a category that – 15 years into Marvel’s modern run, beginning with “Iron Man” – might have begun to feel a trifle stale and predictable.\n\nLike “The Boys,” “Gen V” has explored the corruptible side of superheroes, with its college-age characters at the appropriately named Godolkin University (God U, for short) yearning for a place among the Seven, the amoral heroes brought to the world by a shadowy corporation more interested in public relations and profits than the public good.\n\n“Invincible” might be animated, but it’s equally dark, with its Superman-like strange visitor from another planet, Omni-Man, actually having been dispatched to Earth to pave the way for an alien invasion and takeover, leaving his half-human, half-alien son as one of humankind’s last lines of defense. Both shows are beyond gory, creating the kind of visceral thrills that their staider counterparts can’t hope to match. Of course, DC has delved into R-rated fare with “The Suicide Squad” and Marvel has its “Deadpool” sequel in the offing, but the Amazon shows practically exult in their rudeness in a way that reaches new heights, or depths, take your pick.\n\nThe fact that “The Boys,” “Gen V” and “Invincible” play on Prime Video merely reinforces that streaming has created hungry platforms for genre-friendly franchises – including raunchier ones, like Max’s “Peacemaker” – while further adding to the crush of viewing options featuring characters in capes and masks.\n\nNotably, the upcoming “Captain Marvel” sequel derives its plural title from a pair of characters introduced via Disney+ series: Monica Rambeau, who acquired her powers in “WandaVision” back in 2021; and “Ms. Marvel,” featuring a superhero-obsessed teenager, which kept the Captain Marvel character, or at least her universe, flickering during the 4 1/2-year gap between movies.\n\nMarvel hit its peak with the release of “Avengers: Endgame” in 2019, so even without streaming and the pandemic, a small letdown was perhaps inevitable. While some quadrants of the internet are already lining up to write the company’s obituary, based on its history and the new arrows in its quiver thanks to the incorporation of one-time Fox assets X-Men and Fantastic Four, such pronouncements sound premature, regardless of how well “The Marvels” performs.\n\nStill, if making superhero movies feel special has already become more challenging, Amazon’s gleefully dark descent into the world of “The Boys,” and programs like it, has made the job that much harder – having to overcome not just homebodies, but Homelander.",
            "Reporter": "by Brian Lowry, LA-News",
            "type": "TV"
        }
       
    ]
}
